demoAPI/src/main/resources/bank-reponse.xsd

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns="http://www.tpb.vn/entity/vn/party/customersvcs/1"
                  xmlns:ns1="http://www.tpb.vn/common/envelope/commonheader/1"
                  xmlns:ns2="http://www.tpb.vn/entity/vn/com/party/1"
                  xmlns:ns3="http://tpb.vn/entity/vn/com/1"
                  xmlns:ns4="http://www.tpb.vn/entity/vn/com/aux/1"
                  xmlns:ns5="http://www.tpb.vn/entity/vn/com/account/1">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:GetCustomerInfoReq>
            <ns1:Header>
                <ns1:Common>
                    <ns1:ServiceVersion>1</ns1:ServiceVersion>
                    <ns1:MessageId>${=java.util.UUID.randomUUID()}</ns1:MessageId>
                    <ns1:TransactionId>${=java.util.UUID.randomUUID()}</ns1:TransactionId>
                    <ns1:MessageTimestamp>${=(new Date().format("yyyy-MM-dd'T'HH:mm:ss"))}</ns1:MessageTimestamp>
                </ns1:Common>
                <ns1:Client>
                    <ns1:SourceAppID>TEST</ns1:SourceAppID>
                    <ns1:UserDetail>
                        <ns1:UserId>ESB</ns1:UserId>
                        <ns1:UserPassword>RVNCMQ==</ns1:UserPassword>
                    </ns1:UserDetail>
                </ns1:Client>
            </ns1:Header>
            <ns:BodyRequest>
                <ns:AuxInfo>
                    <ns4:Xref>ESB123334</ns4:Xref>
                    <ns4:FunctionCode>CUST-GETCUSINFOBYCIFMST-DB-FCC</ns4:FunctionCode>
                </ns:AuxInfo>
                <ns:AccInfo>
                    <ns5:CIFNo>29092005</ns5:CIFNo>
                    <ns5:AdditionInformation>
                        <ns1:NameValuePairs>
                            <ns1:Name>MST</ns1:Name>
                            <ns1:Value>0102100740</ns1:Value>
                        </ns1:NameValuePairs>
                        <ns1:NameValuePairs>
                            <ns1:Name>DKKD</ns1:Name>
                            <ns1:Value>040051000013</ns1:Value>
                        </ns1:NameValuePairs>
                    </ns5:AdditionInformation>
                </ns:AccInfo>
            </ns:BodyRequest>
        </ns:GetCustomerInfoReq>
    </soapenv:Body>
</soapenv:Envelope>






<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Body>
    <io3:GetCustomerInfoRes xmlns:io3="http://www.tpb.vn/entity/vn/party/customersvcs/1" xmlns:io6="http://www.tpb.vn/common/envelope/commonheader/1" xmlns:io7="http://www.tpb.vn/entity/vn/com/account/1" xmlns:io4="http://tpb.vn/entity/vn/com/1" xmlns:io="http://www.tpb.vn/entity/vn/com/party/1">
        <io6:Header>
            <io6:Common>
                <io6:ServiceVersion>1</io6:ServiceVersion>
                <io6:MessageId>3333bfa2-0358-4f74-a55d-1d745689a019</io6:MessageId>
                <io6:TransactionId>286243d3-3d13-4371-b4da-1b75527a3f27</io6:TransactionId>
                <io6:MessageTimestamp>2022-10-03T09:20:16</io6:MessageTimestamp>
            </io6:Common>
            <io6:Client>
                <io6:SourceAppID/>
                <io6:UserDetail>
                    <io6:UserPassword>bnVsbA==</io6:UserPassword>
                </io6:UserDetail>
            </io6:Client>
        </io6:Header>
        <io6:ResponseStatus>
            <io6:Status>0</io6:Status>
            <io6:GlobalErrorCode>00</io6:GlobalErrorCode>
            <io6:GlobalErrorDescription>SUCCESS</io6:GlobalErrorDescription>
            <io6:ErrorInfo/>
        </io6:ResponseStatus>
        <io3:BodyResponse>
                <io3:ListCustInfo>
                <io3:Party>
                    <io:PartyInfo>
                        <io:PersonalPartyInfo>
                            <io:CIFNo>29092005</io:CIFNo>
                            <io:FullName>CUSTOMER29092005</io:FullName>
                            <io:ContactInfo>
                                <io4:AddressInfo>
                                    <io4:Address>ADDRESS_1_29092005 ADDRESS_2_29092005 ADDRESS_3_29092005 ADDRESS_4_29092005</io4:Address>
                                </io4:AddressInfo>
                                <io4:MailAddress>
                                    <io4:Name>hueht32@test.com.vn</io4:Name>
                                </io4:MailAddress>
                            </io:ContactInfo>
                        </io:PersonalPartyInfo>
                    </io:PartyInfo>
                </io3:Party>
                <io3:CustInfo>
                    <io3:CustomerType>I</io3:CustomerType>
                    <io3:CorporateTaxIdentNumb/>
                </io3:CustInfo>
                    <io3:AccInfo>
                    <io7:AdditionInformation>
                        <io6:NameValuePairs>
                            <io6:Name>AUTH_STAT</io6:Name>
                            <io6:Value>A</io6:Value>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>RECORD_STAT</io6:Name>
                            <io6:Value>O</io6:Value>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>DKKD</io6:Name>
                            <io6:Value>000000000769*2324</io6:Value>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD1</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD2</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD3</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD4</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD5</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                    </io7:AdditionInformation>
                </io3:AccInfo>
            </io3:ListCustInfo>
            <io3:ListCustInfo>
                <io3:Party>
                    <io:PartyInfo>
                        <io:PersonalPartyInfo>
                            <io:CIFNo>00006969</io:CIFNo>
                            <io:FullName>CUSTOMER00006969</io:FullName>
                            <io:ContactInfo>
                                <io4:AddressInfo>
                                    <io4:Address>ADDRESS_1_00006969 ADDRESS_2_00006969 ADDRESS_3_00006969 ADDRESS_4_00006969</io4:Address>
                                </io4:AddressInfo>
                                <io4:MailAddress>
                                    <io4:Name>huyen12@test.com.vn</io4:Name>
                                </io4:MailAddress>
                            </io:ContactInfo>
                        </io:PersonalPartyInfo>
                    </io:PartyInfo>
                </io3:Party>
                <io3:CustInfo>
                    <io3:CustomerType>C</io3:CustomerType>
                    <io3:CorporateTaxIdentNumb>0102100740</io3:CorporateTaxIdentNumb>
                </io3:CustInfo>
                <io3:AccInfo>
                    <io7:AdditionInformation>
                        <io6:NameValuePairs>
                            <io6:Name>AUTH_STAT</io6:Name>
                            <io6:Value>A</io6:Value>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>RECORD_STAT</io6:Name>
                            <io6:Value>O</io6:Value>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>DKKD</io6:Name>
                            <io6:Value>0000696976575</io6:Value>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD1</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD2</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD3</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD4</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD5</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                    </io7:AdditionInformation>
                </io3:AccInfo>
            </io3:ListCustInfo>
            <io3:ListCustInfo>
                <io3:Party>
                    <io:PartyInfo>
                        <io:PersonalPartyInfo>
                            <io:CIFNo>00001232</io:CIFNo>
                            <io:FullName>CTY CP TONG CTY DAU TU XAY DUNG 194</io:FullName>
                            <io:ContactInfo>
                                <io4:AddressInfo>
                                    <io4:Address>TOA NHA 194 GOLDEN BUILDING 473 DIEN BIEN PHU, PHUONG 25, QUAN BINH THANH, HO CHI MINH</io4:Address>
                                </io4:AddressInfo>
                                <io4:MailAddress>
                                    <io4:Name/>
                                </io4:MailAddress>
                            </io:ContactInfo>
                        </io:PersonalPartyInfo>
                    </io:PartyInfo>
                </io3:Party>
                <io3:CustInfo>
                    <io3:CustomerType>I</io3:CustomerType>
                    <io3:CorporateTaxIdentNumb/>
                </io3:CustInfo>
                <io3:AccInfo>
                    <io7:AdditionInformation>
                        <io6:NameValuePairs>
                            <io6:Name>AUTH_STAT</io6:Name>
                            <io6:Value>A</io6:Value>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>RECORD_STAT</io6:Name>
                            <io6:Value>O</io6:Value>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>DKKD</io6:Name>
                            <io6:Value>040051000013</io6:Value>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD1</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD2</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD3</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD4</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                        <io6:NameValuePairs>
                            <io6:Name>FIELD5</io6:Name>
                            <io6:Value/>
                        </io6:NameValuePairs>
                    </io7:AdditionInformation>
                </io3:AccInfo>
            </io3:ListCustInfo>
        </io3:BodyResponse>
    </io3:GetCustomerInfoRes>
</soapenv:Body>
</soapenv:Envelope>
